{
  "backend/main.mo": "Actor defining admin auth, storage mixins, and many data types for books, notes, blogs, forum, profiles, and notifications.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of numerous frontend source files and their responsibilities.",
  "frontend/index.css": "Tailwind base styles and OKLCH‑based light/dark theme variable definitions.",
  "frontend/index.html": "Base HTML file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining all routes, layout, and theme/provider wrappers.",
  "frontend/src/components/admin/AdminProfilesPanel.tsx": "Admin panel listing and searching user profiles with loading, error, and selection states.",
  "frontend/src/components/AdminNotifications.tsx": "Empty placeholder component file for admin notifications.",
  "frontend/src/components/AdminSignInPanel.tsx": "Admin sign‑in UI handling Internet Identity login, admin credential submission, and error states.",
  "frontend/src/components/BookComments.tsx": "Displays book comments, allows adding new comments, liking comments, and formatting timestamps.",
  "frontend/src/components/BookRating.tsx": "Shows average book rating, user ratings, and lets authenticated users submit a rating.",
  "frontend/src/components/BookUploadPanel.tsx": "Admin panel for uploading, editing, and deleting books, including file uploads, drag‑and‑drop, and progress tracking.",
  "frontend/src/components/Footer.tsx": "Simple site footer with branding and Instagram link.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, routing links, authentication controls, and mobile menu.",
  "frontend/src/components/LoginRequiredModal.tsx": "Modal prompting users to log in or complete their profile before accessing restricted features.",
  "frontend/src/components/ProfileSetupModal.tsx": "Automatically prompts authenticated users to complete missing profile details and redirects them to the profile page.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user avatar using profile image or name initial with size options.",
  "frontend/src/components/WelcomeMessageModal.tsx": "Modal component showing a welcome message with icons and a button to close/start reading.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and authentication status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, admin data, and other backend resources.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and global typography styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page showing author info, photo, site assets, and Instagram link.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for uploading books, covers, and site assets with drag‑and‑drop, previews, and admin authentication checks.",
  "frontend/src/pages/BlogPage.tsx": "Displays a grid of blog posts with preview media and file‑type icons, loading states, and navigation to post pages.",
  "frontend/src/pages/BlogPostPage.tsx": "Placeholder blog post page showing a 'not available' message using the postId param.",
  "frontend/src/pages/BookReaderPage.tsx": "Loads book metadata and file assets, enforces authentication/profile checks, and displays the book via PDF or document viewer with comments and ratings.",
  "frontend/src/pages/CharacterNoteViewerPage.tsx": "Fetches and displays a character note file (pdf/image/video) with authentication/profile gating and viewer selection.",
  "frontend/src/pages/ForumPage.tsx": "Forum interface for listing threads and creating/replying to posts with authentication and profile‑completion enforcement.",
  "frontend/src/pages/ForumPostPage.tsx": "Placeholder forum post page showing an unavailable‑post message using the postId param.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing featured books, character notes, and blogs with auth-gated navigation and dynamic logo assets.",
  "frontend/src/pages/ProfilePage.tsx": "User profile editor handling validation, avatar upload, and saving profile data.",
  "frontend/src/pages/SettingsPage.tsx": "Admin settings panel for managing books, assets, blogs, character notes, and new coming items with upload and edit tools.",
  "frontend/src/pages/SuggestionsPage.tsx": "Page for authenticated users to submit suggestions and view recent entries with login-gated posting.",
  "frontend/src/utils/errors.ts": "Utility for normalizing errors, classifying admin login issues, and validating file uploads.",
  "frontend/src/utils/time.ts": "Formats bigint timestamps into human-readable relative time strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and removing sensitive params from hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Stores the project’s metadata, feature state, and pending feature requests for the admin user profile listing project."
}