{
  "backend/main.mo": "Main canister actor defining admin auth logic, data models, and storage mixins for books, notes, blogs, forums, and notifications.",
  "backend/migration.mo": "Migration module defining old actor state types and a passthrough run function for upgrade compatibility.",
  "feature_evidence.json": "Empty feature evidence report container with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, layout components, and all app routes.",
  "frontend/src/components/AdminNotifications.tsx": "Empty placeholder file for admin notifications component.",
  "frontend/src/components/AdminSignInPanel.tsx": "Admin sign-in form handling II login, admin credential submission, and error display.",
  "frontend/src/components/BookComments.tsx": "Renders a comment section for a book with form submission, comment listing, liking, and timestamp formatting using query hooks.",
  "frontend/src/components/BookRating.tsx": "Displays average ratings and allows authenticated users to rate a book, preventing duplicate ratings and showing interactive star input.",
  "frontend/src/components/BookUploadPanel.tsx": "Provides an admin-style interface for adding, editing, uploading, and deleting book metadata and files with drag‑and‑drop support and progress tracking.",
  "frontend/src/components/Footer.tsx": "Shows a simple footer with branding, attribution, and a link to the project's Instagram page.",
  "frontend/src/components/Header.tsx": "Implements the main navigation bar with logo, auth controls, mobile menu, and dynamic site logo loading.",
  "frontend/src/components/LoginRequiredModal.tsx": "Modal prompting users to log in or complete their profile, with navigation and status-aware login handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Automatically prompts authenticated users to complete missing profile details and redirects them to the profile page.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user avatar with optional profile image and fallback initial based on the user's name.",
  "frontend/src/components/WelcomeMessageModal.tsx": "A modal component displaying a welcome message, brief site description, and a button to begin reading.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, identity loading, and authentication state via React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user data, admin authentication, and site-related backend operations.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables for light and dark themes and global typography styles.",
  "frontend/src/main.tsx": "Initializes the app root with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page featuring author information, site description, and an Instagram link.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page providing authentication checks and interfaces for uploading books, covers, and site assets.",
  "frontend/src/pages/BlogPage.tsx": "Displays a list of blog posts with previews, file icons, and loading states, using navigation for post selection.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a placeholder blog post page indicating unavailable content and provides navigation back to the blog.",
  "frontend/src/pages/BookReaderPage.tsx": "Loads and displays book files with authentication checks, file viewer handling, and metadata retrieval.",
  "frontend/src/pages/CharacterNoteViewerPage.tsx": "Fetches and displays character notes with file previews and authentication requirements.",
  "frontend/src/pages/ForumPage.tsx": "Renders a thread list and allows creating and replying to threads with profile and authentication checks.",
  "frontend/src/pages/ForumPostPage.tsx": "Placeholder page indicating an unavailable forum post and offering navigation back to the forum.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing featured books, character notes, blog posts, and navigation with authentication gating.",
  "frontend/src/pages/ProfilePage.tsx": "React profile editor that loads user data, validates fields, and handles profile picture upload.",
  "frontend/src/pages/SettingsPage.tsx": "Admin settings dashboard for managing books, assets, blogs, character notes, and new coming items with upload and edit features.",
  "frontend/src/pages/SuggestionsPage.tsx": "Suggestions feed and submission page requiring authentication and profile completion.",
  "frontend/src/utils/errors.ts": "Utility functions for normalizing errors, classifying admin login issues, and validating file uploads.",
  "frontend/src/utils/time.ts": "Converts bigint timestamps into human‑readable relative time strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and managing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements to persist user data across canister upgrades, including books, profiles, posts, comments, and admin uploads."
}