{
  "backend/main.mo": "Primary Motoko canister defining access control, admin session logic, and data types for books, notes, blogs, users, ratings, comments, and forum content.",
  "backend/migration.mo": "Migration module containing type definitions and structures for transitioning stored actor state between versions.",
  "feature_evidence.json": "Feature evidence report listing updated admin sign‑in UX feature with related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference file summarizing major frontend components, pages, styles, and hooks across the application.",
  "frontend/index.css": "Tailwind base styles and theme variables defining color tokens and dark‑mode equivalents.",
  "frontend/index.html": "HTML entry point that mounts the React application and loads the main script.",
  "frontend/src/App.tsx": "Root React routing setup using TanStack Router with global layout, theme provider, and route definitions.",
  "frontend/src/components/AdminNotifications.tsx": "Empty placeholder file for admin notifications component.",
  "frontend/src/components/AdminSignInPanel.tsx": "Admin sign‑in form handling II login, admin credential submission, and detailed error classification.",
  "frontend/src/components/BookComments.tsx": "Handles displaying, posting, and liking book comments with validation, loading states, and timestamp formatting.",
  "frontend/src/components/BookRating.tsx": "Displays average ratings and lets users submit a rating while preventing duplicate ratings.",
  "frontend/src/components/BookUploadPanel.tsx": "Admin panel for adding, editing, deleting, and uploading book files and covers with drag‑and‑drop, previews, and progress tracking.",
  "frontend/src/components/Footer.tsx": "Renders site footer with branding and Instagram link.",
  "frontend/src/components/Header.tsx": "Provides navigation, site logo display, and login/logout handling with mobile menu support.",
  "frontend/src/components/LoginRequiredModal.tsx": "Modal prompting users to log in or complete their profile before accessing restricted content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a profile completion prompt for authenticated users lacking required profile info.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user avatar from a profile image or fallback initial with size options.",
  "frontend/src/components/WelcomeMessageModal.tsx": "Modal component showing a welcome message with book-themed visuals and a button to close.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, stored identities, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin auth, and various backend interactions such as uploads and asset fetching.",
  "frontend/src/index.css": "Tailwind base styles plus custom light/dark theme variables and typography settings.",
  "frontend/src/main.tsx": "Application entry point wiring React Query and Internet Identity providers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying author photo, description, and Instagram link using site assets when available.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page handling admin auth, file uploads, site asset management, and drag‑and‑drop interactions.",
  "frontend/src/pages/BlogPage.tsx": "Displays a grid of blog posts with preview images or file-type icons, loading state, and navigation to individual posts.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a placeholder message for unavailable blog posts and provides navigation back to the blog or home.",
  "frontend/src/pages/BookReaderPage.tsx": "Fetches and displays book files with PDF/Word viewer support, handling authentication, loading states, and profile requirements.",
  "frontend/src/pages/CharacterNoteViewerPage.tsx": "Loads and displays character note files (image, video, PDF) with authentication checks and error handling.",
  "frontend/src/pages/ForumPage.tsx": "Lists forum threads, allows creating threads and posting replies with authentication and profile validation.",
  "frontend/src/pages/ForumPostPage.tsx": "Shows a placeholder page for unavailable forum posts with navigation options.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing featured books, character notes, and blog posts with authentication checks for accessing protected content.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editor that loads user data, validates fields, handles profile picture upload, and saves updates via mutations.",
  "frontend/src/pages/SettingsPage.tsx": "Admin settings panel supporting asset uploads and CRUD operations for books, blogs, notes, and new-coming items.",
  "frontend/src/pages/SuggestionsPage.tsx": "User suggestion form allowing authenticated users to submit ideas with simulated backend submission.",
  "frontend/src/utils/errors.ts": "Utility functions for normalizing backend errors, classifying admin login failures, and validating file uploads.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theming (colors, typography, animations), and plugins like typography and container queries.",
  "project_state.json": "Defines the project’s current state, including known issues and pending feature requests focused on fixing and improving admin authentication."
}