{
  "backend/main.mo": "Defines the main Motoko canister with access control, blob storage mixins, admin session handling, and many public data types for books, assets, user profiles, ratings, comments, and forum structures.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs associated with two authentication‑related feature changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of numerous frontend files including pages, components, hooks, and styles.",
  "frontend/index.css": "Global Tailwind CSS layers and OKLCH‑based light/dark theme variable definitions applied across the site.",
  "frontend/index.html": "Base HTML entry point containing the root div and script loader for the frontend application.",
  "frontend/src/App.tsx": "Sets up the React app’s routing tree, theme provider, layout, and global components like the profile modal and toaster.",
  "frontend/src/components/AdminNotifications.tsx": "Empty placeholder file for future admin notifications component.",
  "frontend/src/components/AdminSignInPanel.tsx": "UI panel for admin authentication using Internet Identity and admin credentials with error handling and login flow logic.",
  "frontend/src/components/BookComments.tsx": "Displays and manages book comments including fetching, posting, liking, and rendering comment lists with validation and timestamps.",
  "frontend/src/components/BookRating.tsx": "Handles book rating retrieval, average display, and user rating submission with UI feedback and user state checks.",
  "frontend/src/components/BookUploadPanel.tsx": "Admin panel for uploading, editing, and deleting books, including file uploads, drag‑and‑drop, previews, and metadata management.",
  "frontend/src/components/Footer.tsx": "Renders site footer with branding, copyright, and social media link.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, routes, login/logout handling, and responsive mobile menu.",
  "frontend/src/components/LoginRequiredModal.tsx": "Modal prompting the user to log in or complete their profile before accessing restricted content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Automatically prompts authenticated users with incomplete profiles to navigate to the profile setup page.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user avatar using a profile image or fallback initial, with configurable sizing.",
  "frontend/src/components/WelcomeMessageModal.tsx": "Modal component showing a welcome message with descriptions and a start button.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user’s identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication and exposing login state and identity.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin auth, and various backend interactions.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying author info, site assets, and an Instagram link.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard providing authentication checks and interfaces for uploading books and site assets.",
  "frontend/src/pages/BlogPage.tsx": "Displays a list of blog posts with thumbnails, file type indicators, and navigation to individual posts while handling loading states.",
  "frontend/src/pages/BlogPostPage.tsx": "Placeholder page showing an unavailable blog post message using the postId param.",
  "frontend/src/pages/BookReaderPage.tsx": "Loads and displays book files with PDF or Word viewers, handles authentication requirements, and shows metadata, comments, and ratings.",
  "frontend/src/pages/CharacterNoteViewerPage.tsx": "Fetches and displays a character note with media viewing support while enforcing authentication and profile completion checks.",
  "frontend/src/pages/ForumPage.tsx": "Shows all forum threads, allows creating threads and replies with authentication checks, and manages thread interactions.",
  "frontend/src/pages/ForumPostPage.tsx": "Placeholder page indicating a forum post is unavailable and showing the postId.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing featured books, character notes, and blog posts with navigation, authentication checks, and dynamic site assets.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editor that loads user data, validates fields, manages profile pictures, and saves updates.",
  "frontend/src/pages/SettingsPage.tsx": "Admin control panel for managing books, assets, blog posts, notes, and upcoming content with upload and edit tools.",
  "frontend/src/pages/SuggestionsPage.tsx": "User suggestion feed and submission form requiring authentication and profile completion.",
  "frontend/src/utils/errors.ts": "Utility functions to normalize errors, classify admin login issues, and validate uploaded files.",
  "frontend/src/utils/time.ts": "Formats bigint timestamps into human‑readable relative time strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, typography, animations, and plugins. It sets content paths, dark mode, container settings, and customizes colors, fonts, and keyframes.",
  "project_state.json": "Project metadata describing the current state, issues, and feature requests related to enabling anonymous read access for suggestions and forum content. Includes architectural notes, known issues, and pending requirements for adjusting frontend and backend authorization behavior."
}