{
  "kind": "build_request",
  "title": "Persist uploaded books and user profiles across upgrades/redeploys",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure all user-generated and admin-managed data is preserved across normal canister upgrades/redeploys (i.e., code updates) so uploaded books and associated metadata are not removed after an upgrade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-12",
          "msg-15"
        ],
        "quotes": [
          "Save the uploaded book and even if the website updates or redoploy the updated things should not be removed.",
          "Save the uploaded book and even if the website updates or redoploy the updated things should not be removed.",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "After uploading at least one book (metadata + file + cover), performing a canister upgrade retains the book in listings and the reader can still fetch the same book assets.",
        "After uploading/editing other stored entities already supported by the canister (site assets, blog posts, character notes, forum threads/replies, suggestions, comments, ratings), performing a canister upgrade retains those entities and they remain readable via existing query methods.",
        "No data is lost on upgrade unless the canister is explicitly reinstalled (documented/implicit IC behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Persist user profiles across normal canister upgrades/redeploys so profiles that users create remain saved and can be accessed by admin workflows after upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-15"
        ],
        "quotes": [
          "All the profiles made should be saved and visible to the admin.",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "After a user saves a profile, performing a canister upgrade preserves that profile (the same principal can still retrieve it).",
        "Admin-only profile visibility (as supported by existing backend methods) continues to work after an upgrade, and previously created profiles remain accessible."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Guaranteeing persistence across canister reinstall/delete actions (only across normal upgrades/redeploys).",
    "Adding third-party databases or external storage providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}