{
  "kind": "build_request",
  "title": "Allow anonymous read access to Suggestions and Forum content",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update backend access control so Suggestions feed and Forum threads (including replies) can be read by anonymous users and by logged-in users with incomplete profiles, while keeping write actions (create suggestion, create thread, reply) restricted to authenticated users with a complete profile.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Yes make it readable"
        ]
      },
      "acceptanceCriteria": [
        "When the caller is anonymous, backend query methods used to fetch the Suggestions feed return data instead of trapping with an Unauthorized/complete-profile error.",
        "When the caller is anonymous, backend query methods used to fetch Forum threads and embedded replies return data instead of trapping with an Unauthorized/complete-profile error.",
        "Backend write methods for suggestions/threads/replies continue to reject anonymous callers and callers without complete profiles with a clear Unauthorized/complete-profile error message.",
        "No existing stored data (suggestions, threads, replies) is lost after deployment."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust frontend data fetching so viewing Suggestions and Forum content does not depend on a successful profile fetch. The app must render the Suggestions feed and Forum threads for logged-out visitors without showing a blocking login/profile modal, while still requiring login+complete profile only for posting actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Yes make it readable"
        ]
      },
      "acceptanceCriteria": [
        "Opening the Suggestions page while logged out shows the community suggestions list (or an empty state) without requiring login.",
        "Opening the Forum page while logged out shows the threads list (or an empty state) without requiring login.",
        "On both pages, attempting to submit a suggestion, create a thread, or post a reply while logged out (or with an incomplete profile) opens the existing LoginRequiredModal and prevents submission.",
        "The loading state on Suggestions/Forum pages does not stay stuck due to a failed/disabled profile query when the user is logged out."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the frontend profile query used across the app resilient for logged-out visitors by treating authorization failures as an unauthenticated state (returning null/disabled query) rather than a hard failure that blocks public pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Yes make it readable"
        ]
      },
      "acceptanceCriteria": [
        "When the user is logged out, the profile query does not spam retries/toasts and does not block rendering of public-readable pages (Suggestions/Forum).",
        "When the user logs in, the profile query refetches and correctly reports whether the profile is complete for gating posting actions.",
        "No changes are required to immutable hook files (useInternetIdentity/useActor), and the solution is implemented via editable hooks/pages (e.g., useQueries and the pages)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if a state layout change is strictly necessary.",
    "Do not edit files under frontend/src/components/ui or any path listed in frontend.immutablePaths.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Making books, blog posts, character notes, or book assets publicly readable without login/profile (only Suggestions and Forum read access are in scope).",
    "Adding third-party authentication or any non-Internet-Identity auth provider.",
    "Introducing real-time updates via WebSockets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Allow Suggestions and Forum content to be readable without requiring login or a completed profile (anonymous read access)."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}